//1
var result1 = 'number' + 3 + 3;// Конкатенація, при спробі додати строку всі значення будуть одним рядком.
a1 = "відповідь №1: ";                //Відповідь number33.
console.log(a1 + result1);
//2
var result2 = null + 3; // Null це нічого, пусто, отже нічого + 3 = 3.
a2 = "відповідь №2: ";  // Відповідь 3.
console.log(a2 + result2);
//3
var result3 = 5 && "qwerty"; //відповідь qwerty, бо нам повертається останнє обчислене значення, так як 5 це true.
a3 = "відповідь №3: ";
console.log(a3 + result3);
//4
var result4 = +'40' + +'2' + "hillel"; // Тут строки '40' '2' за допомогою унарного плюса приводяться до числа,
a4 = "відповідь №4: ";                        // але так як є + біля строки то спрацює конкатенація...
console.log(a4 + result4);                    // то ж отримаємо відповідь 42hillel
//5
var result5 = '10' - 5 === 6;//Js завжди намагається привести все до числа отже строку '10' приведе до числа 10
a5 = "відповідь №5: ";                // далі 10 - 5 буде 5 і строго порівняє з 6, отримаємо відповідь false.
console.log(a5 + result5);
//6
var result6 = true + false; //true це 1, а false це 0, отже 1 + 0 = 1. Відповідь 1.
a6 = "відповідь №6 : ";
console.log(a6 + result6);
//7
var result7 = '4px' - 3; //Сприймається наче ми виконуємо математичну операцію віднімання...
a7 = "відповідь №7: ";           // і так як не можемо отримати відповідь строка мінус число то відповідь Nan.
console.log(a7 + result7);
//8
var result8 = '4' - 3; // Js завжди намагається привести все до числа отже строку '4' приведе до числа...
a8 = "відповідь №8: ";         // Відповідь  4 - 3 = 1.
console.log(a8 + result8);
//9
var result9 = '6' + 3 ** 0; // 3**0 це 1, а де є + і строка як у нас '6' то спрацьовує конкатенація...
a9 = "відповідь №9: ";             // відповідь 61.
console.log(a9 + result9);
//10
var result10 = 12 / '6'; // Js завжди намагається привести все до числа...
a10 = "відповідь №10: ";         // отже строку '6' приведе до числа і 12/6 = 2
console.log(a10 + result10);     //Відповідь 2.
//11
var result11 = '10' + (5 === 6); // в дужках false бо 5 не дорівню 6, строка '10' + false дає конкатинацю.
a11 = "відповідь №11: ";                // Відповідь 10false.
console.log(a11 + result11);
//12
var result12 = null == ''; //бо typeof null це object, а '' це falls boolean...
a12 = "відповідь №12: ";            //тобто порівняння типу object з boolean дасть відповідь false.
console.log(a12 + result12);
//13
var result13 = 3 ** (9 / 3); //в пріорітеті дія в дужках 9/3 = 3, потім 3 ** 3 (в кубі) = 27
a13 = "відповідь №13: ";             // Відповідь 27.
console.log(a13 + result13);
//14
var result14 = !!'false' == !!'true'; // тут перетворення на boolean та подвійне заперечення строки яка є true.
a14 = "відповідь №14: ";                       // виходить порівняння true == true що дає відповідь true.
console.log(a14 + result14);
//15
var result15 = 0 || '0' && 1; //для || ідемо до першого true, 0 це false далі '0' це true.
a15 = "відповідь №15: ";              // (для && ідемо до першого false) а в нас true && 1 (тобто true) ...
console.log(a15 + result15);          // а так як немає false то виводимо останнє обчислене значення. Відповідь 1.
//16
var result16 = (+null == false) < 1; // +null це 0, а 0 це false отже в дужках отримаємо true...
a16 = "відповідь №16: ";                      // далі true це 1, а 1 не менше 1.
console.log(a16 + result16);                  // Відповідь false.
//17
var result17 = false && true || true; // false && true дає false,...
a17 = "відповідь №17: ";                       //потім цей false || true де як тільки ми знайшли true виходимо.
console.log(a17 + result17);                   // Відповідь true.
//18
var result18 = false && (false || true);// в цьому випадку в піорітеті те що в дужках, а там true...
a18 = "відповідь №18: ";                         // далі false && true де як тільки знайшли false виходимо.
console.log(a18 + result18);                     // Відповідь false.
//19
var result19 = (+null == false) < 1 ** 5; // +null це 0, а 0 це false отже в дужках отримаємо true...
a19 = "відповідь №19: ";                           // далі true це 1, а 1 не менше 1 в пятій степені, відповідь false.
console.log(a19 + result19);

