//ЗАДАЧА 1.
//Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу):
// на першому рядку - одна зірочка, на другому - дві, і так далі. Рішення оформіть у вигляді функції,
// куди передаються два параметри: висота трикутника та символ, яким його потрібно "малювати".

//1. For //
function drawTriangle(h , j)
{
    for (let g = 1; g <= h; g++) {
        console.log(j);
        j += "*";
    }
}
drawTriangle (5, "*");

//2. While  //
function drawTriangle2(d , l)
{
    let g = 1;
    while (g<=d){
        g++
        console.log(l);
        l += "*";
    }
}
drawTriangle2 (5, "*");


